Revit 2027 API
AnalysisDisplayColorSettings.SetIntermediateColors Method
 Set intermediate color entries (other than the minimum and maximum settings).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetIntermediateColors(
	IList<AnalysisDisplayColorEntry> map
)
Public Sub SetIntermediateColors (
	map As IList(Of AnalysisDisplayColorEntry)
)
public:
void SetIntermediateColors(
	IList<AnalysisDisplayColorEntry^>^ map
)
member SetIntermediateColors :
        map : IList<AnalysisDisplayColorEntry> -> unit
Parameters
map IList<AnalysisDisplayColorEntry>
 Array of intermediate color entries.
Exceptions
Exception | Condition
ArgumentException |  intermediate color entries with specific values are not ordered by value (min to max) or too many intermediate colors (>100).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace